[
  {
    "date": "04.11.2024 - 25.11.2024",
    "title": "DevLog #6",
    "content": "a lot of progress happened at the start of November such everything corrupting which gave me the perfect reason to switch to unity6 something I've wanted to do since it released after making the move small bits of progress happened here and there such as a start menu that both looks ok and works but the game has mostly put on hold due to me being busy with other stuff such as a website for us(only in the past week or two but plenty of progress made and works well), I've also been helping other people learn unity and c# as this helps me check I know stuff so its worth doing, also doing a lot of personal stuff as I'm not on a strict timeframe for the game. In terms of future plans I'm going to start making some basic sprits that will likely just be text to say hat an action is and then coding the mechanics behind more of our planned features I may also start on some level/map design but devlogs will be less often now the game is at the current point where the mechanics which will obviously be in the game(movement, inventory, animations, start menu, etc). The final thing ill say is that i have begun work on npc ai :D",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  },
  {
    "date": "29.10.2024 - 03.11.2024",
    "title": "DevLog #5",
    "content": "Not much changed at first due to me being on holiday but once i got home alot of story decisions were discussed and decided on which lead to character customisation being removed due to not fitting the desired game idea, my beautiful combat system which I spent oh so long getting to work has also been fully removed as combat does not fit the desired game idea either but now we have a better plan of what we want in the game I can continue to make code that is actually helpful to the game and Derpy can soon begin work on assets.",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  },
  {
    "date": "28.10.2024",
    "title": "DevLog #4",
    "content": "Not much work was done today as i left to go away for a few days. I began implementing a system to seperate each menu of the character customisation menu(eyes, hair, accessories, etc) as at the moment if i finished the system as is the items would all be in every menu. If i continue to do an hour each day while I'm away i should get this fully finished and possibly even finish the menu side of character customisation then only needing to make the visual side so that wha you select actually shows up.",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  },
  {
    "date": "27.10.2024",
    "title": "DevLog #3",
    "content": "Work was slowed today due to real life stuff but when i finally got back to working on the game I continued work on character customisation spending longer on a more complex system so adding cosmetics in future will be really easy.",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  },
  {
    "date": "26.10.2024",
    "title": "DevLog #2",
    "content": "A basic story has been made and the games theme has been decided so work on more specific code can start being worked on and concept art will start being produced soon. The inventory system will be modified to fit the new plan for the new game plan. Character customisation will continue to be developed with the changes of clothes being switched from having lots of options unlocked at the start to having only 1 or 2 outfits more being unlocked in gameplay. The current combat system will likely either be completely removed or drastically changed.",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  },
  {
    "date": "pre 26.10.2024",
    "title": "DevLog #1",
    "content": "temp assets were purchased so work can begin and an inventory system, ui for inventory and hotbar, basic combat system, most player animations, complete movement system, basic start menu, complete pickup system and early version of character customisation have been completed",
    "devlog": true,
    "major": false,
    "images": 0,
    "image_url": []
  }
]